//JCLIF01 JOB (035D),
//        'USER',
//        CLASS='A',
//        PRTY=6,NOTIFY=&SYSUID
//****************
//STEP01 EXEC PGM=COBIF01
//SYSIN     DD *
RAZVANEUR10006234567ROM
RAZVANEUR10006234567USA
RAZVANEUR10005234567GBR
RAZVANEUR10005234567BGL
RAZVANEUR10004234567ROP
RAZVANEUR10006234567ROM
RAZVANEUR10005234567GBR
RAZVANEUR10005234567BGL
RAZVANEUR10004234567ROM
/*
